scripts/load-test.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 2
    - duration: 120
      arrivalRate: 5
    - duration: 60
      arrivalRate: 10
    - duration: 60
      arrivalRate: 0
  defaults:
    headers:
      User-Agent: 'Artillery Load Test'

scenarios:
  - name: 'Homepage Load'
    weight: 50
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
            - hasProperty: responseTime
              lte: 2000
      - think: 3
      - get:
          url: '/assets/index-DlQBNw6I.css'
          expect:
            - statusCode: 200
      - get:
          url: '/assets/index-BIgxSKDi.js'
          expect:
            - statusCode: 200

  - name: 'Page Navigation'
    weight: 30
    flow:
      - get:
          url: '/'
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: '/privacy'
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: '/terms'
          expect:
            - statusCode: 200

  - name: 'Static Assets'
    weight: 20
    flow:
      - get:
          url: '/favicon.ico'
          expect:
            - statusCode: 200
      - get:
          url: '/robots.txt'
          expect:
            - statusCode: 200
      - get:
          url: '/assets/react-vendor-DUcEVBCR.js'
          expect:
            - statusCode: 200